{"title": "Keyphrase Extraction from Scientific Articles via Extractive Summarization","abstract": "Automatically extracting keyphrases from scholarly documents leads to a valuable concise representation that humans can understand and machines can process for tasks, such as information retrieval, article clustering, and article classification. This paper is concerned with the parts of a scientific article that should be given as input to keyphrase extraction methods. Recent deep learning methods take titles and abstracts as input due to the increased computational complexity in processing long sequences, whereas traditional approaches can also work with full-texts. Titles and abstracts are dense in keyphrases, but often miss important aspects of the articles, while full-texts on the other hand are richer in keyphrases but much noisier. To address this trade-off, we propose the use of extractive summarization models on the full-texts of scholarly documents. Our empirical study on 3 article collections using 3 keyphrase extraction methods shows promising results.","fulltext": "Automatic keyphrase extraction is the process of identifying representative phrases in a document that summarize its content. Keyphrases are important pieces of information for many applications, including information retrieval (Ji et al., 2019; Boudin et al., 2020), text classification (Meng et al., 2019), text summarization (Song et al., 2019), entity recognition (Du et al., 2018) and event detection (Hossny et al., 2020). This work focuses on keyphrase extraction from scholarly documents. In particular, we consider an interesting issue in this domain, which concerns the part of a scientific article that should be given as input to keyphrase extraction methods. Table 1 shows representative supervised and unsupervised keyphrase extraction methods from the most popular categories of the task (deep learning, traditional supervised, graph-based, and statistics-based), along with the parts of academic articles that they consider, among Title+Abstract (TA), Full-text (F) and other Specific Parts (S/P). Approaches TA F S/P Deep Learning Table 1: Types of textual content, i.e., Title+Abstract (TA), Full-text (F), and Specific Parts (S/P) of the document, used by supervised and unsupervised keyphrase extraction approaches in the training and evaluation process. Approaches with an asterisk (*) are evaluated on TAs and Fs in Hasan and Ng (2010). We can see that recent deep learning keyphrase extraction and generation methods take titles and abstracts as input, due to the complexity in processing larger sequences. Traditional supervised learning methods, as well as unsupervised ones, can handle full-texts, but this does not necessarily lead to better results compared to using just titles and abstracts."}
